app/controllers/free_samples_controller.rb

  def index
    @free_samples = FreeSample.all
---
SELECT "free_samples".* FROM "free_samples"