app/controllers/samples_controller.rb

SELECT "samples".* FROM "samples" WHERE "samples"."user_id" = $1  [["user_id", 4]]
---
  def index

    @samples = Sample.where(:user => @user)

INSERT INTO "samples" ("microwave", "stapler", "pentap", "scissors", "spacebar", "mouseclick", "user_id", "created_at", "updated_at", "name") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    @sample = Sample.new(sample_params)

    if @sample.save

UPDATE "samples" SET "microwave" = $1, "stapler" = $2, "pentap" = $3, "scissors" = $4, "spacebar" = $5, "mouseclick" = $6, "updated_at" = $7 WHERE "samples"."id" = $8
---
  def update
    if @sample.update(sample_params)

DELETE FROM "samples" WHERE "samples"."id" = $1  [["id", 10]]
---
  def destroy
    @sample.destroy

SELECT "samples".* FROM "samples" WHERE "samples"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
    def set_sample
      @sample = Sample.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_user
      @user = User.find(params[:user_id])